"use client";

import { motion } from "framer-motion";

export default function IntroText() {
  return (
    <motion.div
      initial={{ opacity: 0, y: 30 }}
      whileInView={{ opacity: 1, y: 0 }}
      transition={{ duration: 0.7, delay: 0.2 }}
      viewport={{ once: true }}
      className='leading-relaxed text-justify w-[90%] text-darker-black/80 mx-auto py-10 text-sm sm:text-base text-tusi space-y-4'>
      <p className='text-lg font-bold text-tusi'>فروشگاه اینترنتی آراکس</p>
      <p>
        ما، تنها یک فروشگاه اینترنتی نیستیم — ما همراه روزهای خاص و لحظات
        روزمره‌ی عزیزان هستیم. با افتخار، مجموعه‌ای از{" "}
        <strong>
          کیف زنانه، کفش، کتونی، اکسسوری، عینک آفتابی، کوله‌پشتی و کیف پول
        </strong>
        و دیگر محصولات شیک و کاربردی را گرد هم آورده‌ایم تا شما را در ساختن
        استایل منحصر‌به‌فردتان همراهی کنیم.
      </p>
      <p>
        ما بر این باوریم که <strong>زیبایی در جزئیات است</strong>. به همین دلیل،
        هر محصول با دقت بالا، طراحی به‌روز و کیفیت تضمین‌شده انتخاب شده تا
        پاسخ‌گوی نیاز و سلیقه‌ی شما عزیزان شیک‌پوش باشد.
      </p>
      <p>
        ما شما را تنها به‌عنوان یک خریدار نمی‌بینیم، بلکه به‌عنوان{" "}
        <strong>همراهی الهام‌بخش</strong> که ما را به ارائه‌ی بهتر و متفاوت‌تر
        سوق می‌دهد، ارج می‌نهیم.
      </p>
      <p>
        با خدماتی مانند{" "}
        <strong>ارسال سریع، پشتیبانی ۲۴ ساعته و تضمین اصالت کالا</strong>، هدف
        ما ساختن تجربه‌ای لذت‌بخش و خاطره‌انگیز از خرید آنلاین است.
      </p>
      <p>
        به ما بپیوندید و دنیایی از استایل، کیفیت و خلاقیت را در کنار هم تجربه
        کنیم.
        <strong>
          {" "}
          فروشگاه ایج‌تی، جایی برای عزیزانی که خاص بودن را انتخاب می‌کنند.
        </strong>
      </p>
    </motion.div>
  );
}
